noless-zz/esp8266-led-strip-clock/src/main.cpp
  <!-- Colors -->
  <div class="card">
    <div class="card-title">COLORS</div>
    <div class="color-row">
      <div class="color-pick">
        <label>PRIMARY</label>
        <input type="color" id="color1" value="#ff0050" onchange="sendColor()">
      </div>
      <div class="color-pick">
        <label>SECONDARY</label>
        <input type="color" id="color2" value="#0078ff" onchange="sendColor()">
      </div>
    </div>
  </div>

  <!-- Effects -->
  <div class="card">
    <div class="card-title">EFFECTS</div>
    <div class="effects-grid" id="fxGrid">
      <button class="fx-btn active" onclick="setEffect(0)">Solid</button>
      <button class="fx-btn" onclick="setEffect(1)">Rainbow</button>
      <button class="fx-btn" onclick="setEffect(2)">Chase</button>
      <button class="fx-btn" onclick="setEffect(3)">Breathe</button>
      <button class="fx-btn" onclick="setEffect(4)">Fire</button>
      <button class="fx-btn" onclick="setEffect(5)">Twinkle</button>
      <button class="fx-btn" onclick="setEffect(6)">Wave</button>
      <button class="fx-btn" onclick="setEffect(7)">Gradient</button>
    </div>
  </div>

  <!-- WiFi Setup -->
  <div class="card">
    <div class="card-title">WIFI SETUP</div>
    <div class="wifi-row" style="margin-bottom:8px">
      <select id="ssidList"></select>
      <button class="mini-btn" onclick="scanWifi()">SCAN</button>
    </div>
    <div class="wifi-row">
      <input type="password" id="wifiPass" placeholder="WiFi password">
      <button class="mini-btn" onclick="connectWifi()">CONNECT</button>
    </div>
    <div class="status-msg" id="wifiMsg"></div>
  </div>

  <!-- OTA Update -->
  <div class="card">
    <div class="card-title">FIRMWARE UPDATE</div>
    <div class="upload-area" onclick="document.getElementById('fwFile').click()">
      <p id="fileName">Select .bin firmware file</p>
      <input type="file" id="fwFile" accept=".bin" style="display:none" onchange="fileSelected(this)">
    </div>
    <button class="upload-btn" id="uploadBtn" onclick="uploadFirmware()" disabled>UPLOAD</button>
    <div class="progress-bar" id="progBar"><div class="progress-fill" id="progFill"></div></div>
    <div class="status-msg" id="statusMsg"></div>
  </div>

  <!-- Info -->
  <div class="card">
    <div class="card-title">DEVICE INFO</div>
    <div class="info-row"><span>Firmware</span><span id="fwVersion">-</span></div>
    <div class="info-row"><span>LEDs</span><span id="ledCount">-</span></div>
    <div class="info-row"><span>AP SSID</span><span id="apSsid">-</span></div>
    <div class="info-row"><span>Host</span><span id="host">-</span></div>
    <div class="info-row"><span>IP</span><span id="ip">-</span></div>
    <div class="info-row"><span>Heap</span><span id="heap">-</span></div>
  </div>

  <!-- Connection Stats -->
  <div class="card" id="staCard" style="display:none">
    <div class="card-title">WIFI CONNECTION</div>
    <div class="info-row"><span>SSID</span><span id="staSsid">-</span></div>
    <div class="info-row"><span>Signal</span><span id="staSignal">-</span></div>
    <div class="info-row"><span>Quality</span><span id="staQuality">-</span></div>
    <div class="info-row"><span>Channel</span><span id="staChannel">-</span></div>
    <div class="info-row"><span>BSSID</span><span id="staBssid">-</span></div>
  </div>

  <!-- Telemetry -->
  <div class="card">
    <div class="card-title">TELEMETRY</div>
    <div class="info-row"><span>Mode</span><span id="safeMode">-</span></div>
    <div class="info-row"><span>Reset</span><span id="resetReason">-</span></div>
    <div class="info-row"><span>Crash Count</span><span id="crashCount">-</span></div>
    <div class="info-row"><span>Loop (us)</span><span id="loopLatency">-</span></div>
    <div class="info-row"><span>Heap Trend</span><span id="heapTrend">-</span></div>
    <div class="info-row"><span>WiFi Reconnects</span><span id="wifiReconn">-</span></div>
  </div>
</div>

<script>
const API = '';
let debounce = null;
let fwPrecheckOk = false;
let fwPrecheckSummary = '';
const OTA_REBOOT_KEY = 'otaRebootPending';

function saveOtaRebootState(meta = {}) {
  try {
    localStorage.setItem(OTA_REBOOT_KEY, JSON.stringify({
      at: Date.now(),
      ...meta
    }));
  } catch (_) {}
}

function readOtaRebootState() {
  try {
    const raw = localStorage.getItem(OTA_REBOOT_KEY);
    if (!raw) return null;
    return JSON.parse(raw);
  } catch (_) {
    return null;
  }
}

function clearOtaRebootState() {
  try { localStorage.removeItem(OTA_REBOOT_KEY); } catch (_) {}
}

function waitForDeviceAfterUpdate() {
  const statusMsg = document.getElementById('statusMsg');
  const uploadBtn = document.getElementById('uploadBtn');
  const startedAt = Date.now();

  statusMsg.textContent = 'Firmware uploaded. Reconnecting after reboot...';
  statusMsg.className = 'status-msg';
  uploadBtn.disabled = true;

  const tryReconnect = () => {
    fetch('/api/status?ts=' + Date.now(), { cache: 'no-store' })
      .then(r => {
        if (!r.ok) throw new Error('status not ready');
        return r.json();
      })
      .then(d => {
        const last = readOtaRebootState();
        clearOtaRebootState();
        const bytes = (d.ota_status && d.ota_status.written_bytes) ? d.ota_status.written_bytes : ((last && last.written) ? last.written : 0);
        statusMsg.textContent = `Update successful (${bytes} bytes). Device reconnected at ${d.ip || 'online'}.`;
        statusMsg.className = 'status-msg status-ok';
        uploadBtn.disabled = false;
        pollStatus();
      })
      .catch(() => {
        if (Date.now() - startedAt > 90000) {
          statusMsg.textContent = 'Device is still rebooting. Refresh in a few seconds.';
          statusMsg.className = 'status-msg status-err';
          uploadBtn.disabled = false;
          return;
        }
        setTimeout(tryReconnect, 1500);
      });
  };

  setTimeout(tryReconnect, 800);
}

function send(url) {
  fetch(API + url).catch(e => console.warn(e));
}

function togglePower() {
  const t = document.getElementById('powerToggle');
  t.classList.toggle('on');
  send('/api/power?on=' + (t.classList.contains('on') ? '1' : '0'));
}

function sendSlider(param, val) {
  document.getElementById(param === 'brightness' ? 'brVal' : 'spVal').textContent = val;
  clearTimeout(debounce);
  debounce = setTimeout(() => send('/api/' + param + '?value=' + val), 50);
}

function sendColor() {
  const c1 = document.getElementById('color1').value;
  const c2 = document.getElementById('color2').value;
  send('/api/color?c1=' + encodeURIComponent(c1) + '&c2=' + encodeURIComponent(c2));
}

function setEffect(idx) {
  document.querySelectorAll('.fx-btn').forEach((b, i) => b.classList.toggle('active', i === idx));
  send('/api/effect?id=' + idx);
}

function fileSelected(input) {
  const uploadBtn = document.getElementById('uploadBtn');
  const statusMsg = document.getElementById('statusMsg');
  fwPrecheckOk = false;
  fwPrecheckSummary = '';
  uploadBtn.disabled = true;

  if (input.files.length === 0) return;

  const file = input.files[0];
  document.getElementById('fileName').textContent = file.name;
  statusMsg.textContent = 'Checking firmware...';
  statusMsg.className = 'status-msg';

  const reader = new FileReader();
  reader.onload = () => {
    const bytes = new Uint8Array(reader.result);
    const magic = bytes.length > 0 ? bytes[0] : 0;
    fetch(`/api/update/precheck?name=${encodeURIComponent(file.name)}&size=${file.size}&magic=${magic}`)
      .then(r => r.json())
      .then(d => {
        fwPrecheckOk = !!d.ok;
        fwPrecheckSummary = d.summary || '';
        if (d.ok) {
          uploadBtn.disabled = false;
          statusMsg.textContent = `Precheck OK: ${d.summary}`;
          statusMsg.className = 'status-msg status-ok';
        } else {
          uploadBtn.disabled = true;
          statusMsg.textContent = `Precheck failed: ${d.error || 'Invalid firmware file'}`;
          statusMsg.className = 'status-msg status-err';
        }
      })
      .catch(() => {
        uploadBtn.disabled = true;
        statusMsg.textContent = 'Precheck request failed';
        statusMsg.className = 'status-msg status-err';
      });
  };
  reader.onerror = () => {
    uploadBtn.disabled = true;
    statusMsg.textContent = 'Failed to read firmware file';
    statusMsg.className = 'status-msg status-err';
  };
  reader.readAsArrayBuffer(file.slice(0, 1));
}

function uploadFirmware() {
  const file = document.getElementById('fwFile').files[0];
  if (!file) return;
  const statusMsg = document.getElementById('statusMsg');
  if (!fwPrecheckOk) {
    statusMsg.textContent = 'Run precheck first (re-select firmware file)';
    statusMsg.className = 'status-msg status-err';
    return;
  }
  if (!confirm(`Approve firmware upload?\n\n${fwPrecheckSummary}`)) {
    return;
  }

  const formData = new FormData();
  formData.append('firmware', file);
  const xhr = new XMLHttpRequest();
  const progBar = document.getElementById('progBar');
  const progFill = document.getElementById('progFill');
  progBar.style.display = 'block';
  statusMsg.textContent = '';
  statusMsg.className = 'status-msg';
  document.getElementById('uploadBtn').disabled = true;

  xhr.upload.addEventListener('progress', (e) => {
    if (e.lengthComputable) progFill.style.width = (e.loaded / e.total * 100) + '%';
  });
  xhr.addEventListener('load', () => {
    let payload = null;
    try { payload = JSON.parse(xhr.responseText); } catch (_) {}
    if (xhr.status === 200 && payload && payload.ok) {
      const writtenBytes = (payload.written && payload.written > 0) ? payload.written : file.size;
      saveOtaRebootState({
        written: writtenBytes,
        expected: payload.expected || 0,
        file: file.name
      });
      statusMsg.textContent = `Update OK (${writtenBytes} bytes). Rebooting...`;
      statusMsg.className = 'status-msg status-ok';
      setTimeout(() => location.reload(), 1200);
      return;
    }

