noless-zz/esp8266-led-strip-clock/src/main.cpp
    const err = payload && payload.error ? payload.error : xhr.responseText;
    statusMsg.textContent = `Upload failed: ${err}`;
    statusMsg.className = 'status-msg status-err';
    document.getElementById('uploadBtn').disabled = false;
  });
  xhr.addEventListener('error', () => {
    // During successful OTA, connection can drop when device restarts.
    saveOtaRebootState({ file: file.name });
    waitForDeviceAfterUpdate();
  });
  xhr.open('POST', '/api/update?approve=1');
  xhr.send(formData);
}

function scanWifi(attempt = 0) {
  const list = document.getElementById('ssidList');
  const msg = document.getElementById('wifiMsg');
  if (attempt === 0) {
    msg.textContent = 'Scanning...';
    msg.className = 'status-msg';
  }
  fetch('/api/wifi/scan').then(r => r.json()).then(d => {
    if (d.scanning) {
      if (attempt > 25) {
        msg.textContent = 'Scan timeout';
        msg.className = 'status-msg status-err';
        return;
      }
      setTimeout(() => scanWifi(attempt + 1), 350);
      return;
    }

    list.innerHTML = '';
    if (!d.networks || d.networks.length === 0) {
      const opt = document.createElement('option');
      opt.value = '';
      opt.textContent = 'No networks found';
      list.appendChild(opt);
      msg.textContent = 'No SSIDs detected';
      return;
    }
    d.networks.forEach(n => {
      const opt = document.createElement('option');
      opt.value = n.ssid;
      opt.textContent = `${n.ssid} (${n.rssi} dBm)`;
      list.appendChild(opt);
    });
    msg.textContent = `Found ${d.networks.length} networks`;
    msg.className = 'status-msg status-ok';
  }).catch(() => {
    msg.textContent = 'Scan failed';
    msg.className = 'status-msg status-err';
  });
}

function connectWifi() {
  const ssid = document.getElementById('ssidList').value;
  const pass = document.getElementById('wifiPass').value;
  const msg = document.getElementById('wifiMsg');
  if (!ssid) {
    msg.textContent = 'Select an SSID first';
    msg.className = 'status-msg status-err';
    return;
  }
  msg.textContent = `Connecting to ${ssid}...`;
  msg.className = 'status-msg';

  const pollConnect = (attempt = 0) => {
    fetch('/api/wifi/connect').then(r => r.json()).then(d => {
      if (d.connecting) {
        if (attempt > 60) {
          msg.textContent = 'Connection timeout';
          msg.className = 'status-msg status-err';
          return;
        }
        setTimeout(() => pollConnect(attempt + 1), 500);
        return;
      }

      if (d.connected) {
        msg.textContent = `Connected! Open http://${d.hostname}.local/ or ${d.ip}`;
        msg.className = 'status-msg status-ok';
      } else {
        msg.textContent = d.error || 'Connection failed';
        msg.className = 'status-msg status-err';
      }
      pollStatus();
    }).catch(() => {
      msg.textContent = 'Connection status check failed';
      msg.className = 'status-msg status-err';
    });
  };

  const p = new URLSearchParams({ ssid, pass });
  fetch('/api/wifi/connect?' + p.toString()).then(r => r.json()).then(d => {
    if (!d.connecting) {
      msg.textContent = d.error || 'Failed to start connection';
      msg.className = 'status-msg status-err';
      return;
    }
    pollConnect();
  }).catch(() => {
    msg.textContent = 'Connection request failed';
    msg.className = 'status-msg status-err';
  });
}

// Poll status
function pollStatus() {
  fetch('/api/status').then(r => r.json()).then(d => {
    document.getElementById('fwVersion').textContent = d.fw_version || '-';
    document.getElementById('ledCount').textContent = (typeof d.num_leds !== 'undefined') ? d.num_leds : '-';
    document.getElementById('heap').textContent = Math.round(d.heap / 1024) + ' KB';
    document.getElementById('apSsid').textContent = d.ap_ssid || '-';
    document.getElementById('host').textContent = d.hostname ? (d.hostname + '.local') : '-';
    document.getElementById('ip').textContent = d.ip || '-';
    document.getElementById('powerToggle').classList.toggle('on', d.power);
    document.getElementById('brightness').value = d.brightness;
    document.getElementById('brVal').textContent = d.brightness;
    document.getElementById('speed').value = d.speed;
    document.getElementById('spVal').textContent = d.speed;
    document.querySelectorAll('.fx-btn').forEach((b, i) => b.classList.toggle('active', i === d.effect));
    
    // Update connection stats
    const staCard = document.getElementById('staCard');
    if (d.connected && d.sta_ssid) {
      staCard.style.display = 'block';
      document.getElementById('staSsid').textContent = d.sta_ssid;
      document.getElementById('staSignal').textContent = d.sta_rssi + ' dBm';
      document.getElementById('staQuality').textContent = d.sta_quality;
      document.getElementById('staChannel').textContent = d.sta_channel;
      document.getElementById('staBssid').textContent = d.sta_bssid;
    } else {
      staCard.style.display = 'none';
    }

    document.getElementById('safeMode').textContent = d.safe_mode ? 'SAFE (AP-only)' : 'NORMAL';
    document.getElementById('resetReason').textContent = d.reset_reason || '-';
    document.getElementById('crashCount').textContent = (d.crash_count ?? 0).toString();
    document.getElementById('loopLatency').textContent = `${d.loop_latency_us || 0} / max ${d.loop_latency_max_us || 0}`;
    const trend = d.heap_trend_delta || 0;
    const trendSign = trend > 0 ? '+' : '';
    document.getElementById('heapTrend').textContent = `${trendSign}${trend} (min ${d.heap_trend_min || 0}, max ${d.heap_trend_max || 0})`;
    document.getElementById('wifiReconn').textContent = (d.wifi_reconnects ?? 0).toString();
  }).catch(() => {});
}
pollStatus();
scanWifi();
if (readOtaRebootState()) {
  waitForDeviceAfterUpdate();
}
setInterval(pollStatus, 5000);
</script>
</body>
</html>
)rawliteral";

// ─── Setup ───────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  Serial.println("\n\n=== LED Controller Starting ===");
  Serial.printf("FW Version: %s (built %s at %s)\n", FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME);
  bootStartedAt = millis();
  evaluateSafeModeOnBoot();

  buildDeviceIdentity();
  setupLEDs();
  loadLedPowerState();
  if (safeModeActive) {
    applySafeModeDefaults();
  }
  setupWiFi();
  setupDNS();
  setupMDNS();
  setupOTA();
  setupWebServer();

  Serial.println("=== Ready! AP: " + apSsid + " / Host: " + localHostname + ".local ===");
}

void loop() {
  dnsServer.processNextRequest();
  if (mdnsStarted) {
    MDNS.update();
  } else if (WiFi.status() == WL_CONNECTED) {
    setupMDNS();
  }
  if (!safeModeActive) {
    updateWiFiConnect();
    checkPeriodicStaRetry();
  }
  trackClientActivity();
  updateTelemetry();
  flushOtaDebugLogs();
  maybeClearCrashCounterAfterStableUptime();
  ArduinoOTA.handle();
  updateLEDs();
}

