noless-zz/esp8266-led-strip-clock/src/main.cpp
void flushOtaDebugLogs() {
  if (otaDbg.pendingInit) {
    otaDbg.pendingInit = false;
    Serial.printf("[OTA][INIT] expected=%u maxUpdate=%u heap=%u\n",
                  otaDbg.expectedBytes,
                  otaDbg.maxUpdateSize,
                  otaDbg.initHeap);
  }

  if (otaDbg.pendingError) {
    otaDbg.pendingError = false;
    Serial.printf("[OTA][ERR] cb=%u chunks=%u off=%u req=%u wrote=%u err=%u heap=%u\n",
                  otaDbg.cbCount,
                  otaDbg.chunkCount,
                  otaDbg.lastOffset,
                  otaDbg.lastReqChunk,
                  otaDbg.lastWrote,
                  otaDbg.lastErr,
                  otaDbg.lastHeap);
  }

  if (otaDbg.pendingFinal) {
    otaDbg.pendingFinal = false;
    Serial.printf("[OTA][FINAL] ok=%d dtMs=%u bytes=%u/%u chunks=%u maxDtUs=%u err=%u\n",
                  otaDbg.finalOk ? 1 : 0,
                  otaDbg.finalDtMs,
                  otaDbg.totalBytes,
                  otaDbg.expectedBytes,
                  otaDbg.chunkCount,
                  otaDbg.maxDtUs,
                  otaDbg.lastErr);
  }
}

void buildDeviceIdentity() {
  String mac = WiFi.macAddress();
  mac.replace(":", "");
  deviceId = mac.substring(mac.length() - 6);
  deviceId.toUpperCase();
  apSsid = String(AP_SSID_BASE) + "-" + deviceId;
  localHostname = String("ledportal-") + deviceId;
  localHostname.toLowerCase();
}

// ─── WiFi AP ─────────────────────────────────────────────
void setupWiFi() {
  WiFi.persistent(true);
  if (safeModeActive) {
    WiFi.mode(WIFI_AP);
    WiFi.softAP(apSsid.c_str(), AP_PASS);
    delay(100);
    Serial.println("[SAFE MODE] AP-only mode enabled");
    Serial.print("[SAFE MODE] AP IP: ");
    Serial.println(WiFi.softAPIP());
    return;
  }

  WiFi.mode(WIFI_AP_STA);
  WiFi.hostname(localHostname.c_str());
  WiFi.softAP(apSsid.c_str(), AP_PASS);
  delay(100);
  Serial.print("AP IP: ");
  Serial.println(WiFi.softAPIP());

  if (WiFi.SSID().length() > 0 && beginWiFiConnectAttempt(8000, false)) {
    WiFi.begin();
    Serial.println("Trying saved STA credentials...");
  }
}

// ─── DNS (Captive Portal) ────────────────────────────────
void setupDNS() {
  if ((WiFi.getMode() & WIFI_AP) == 0) {
    return;
  }
  // Redirect all DNS queries to our IP → captive portal
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
}

void setupMDNS() {
  if (WiFi.status() != WL_CONNECTED || mdnsStarted) {
    return;
  }
  if (MDNS.begin(localHostname.c_str())) {
    mdnsStarted = true;
    Serial.print("mDNS: http://");
    Serial.print(localHostname);
    Serial.println(".local");
  } else {
    Serial.println("mDNS start failed");
  }
}

// ─── OTA ─────────────────────────────────────────────────
void setupOTA() {
  ArduinoOTA.setHostname(localHostname.c_str());
  ArduinoOTA.setPassword(OTA_PASS);
  ArduinoOTA.onStart([]() {
    otaVisualActive = true;
    FastLED.clear();
    FastLED.show();
    Serial.println("OTA Start");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    uint8_t pct = progress / (total / 100);
    int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
    int litLeds = map(pct, 0, 100, 0, statusLeds);
    FastLED.clear();
    for (int i = 0; i < litLeds; i++) {
      leds[i] = CRGB(0, 255, 0);
    }
    FastLED.show();
  });
  ArduinoOTA.onEnd([]() {
    int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
    FastLED.clear();
    fill_solid(leds, statusLeds, CRGB::Green);
    FastLED.show();
    otaVisualActive = false;
    Serial.println("OTA Done!");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
    FastLED.clear();
    fill_solid(leds, statusLeds, CRGB::Red);
    FastLED.show();
    otaVisualActive = false;
    Serial.printf("OTA Error[%u]\n", error);
  });
  ArduinoOTA.begin();
}

// ─── LEDs ────────────────────────────────────────────────
void setupLEDs() {
  FastLED.addLeds<WS2812, LED_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(state.brightness);
  FastLED.clear(true);
}

void updateLEDs() {
  if (otaVisualActive) {
    return;
  }

  if (!state.power) {
    EVERY_N_MILLISECONDS(100) {
      FastLED.clear(true);
    }
    return;
  }

  unsigned long interval = map(state.speed, 1, 255, 60, 5);
  unsigned long now = millis();
  if (now - lastUpdate < interval) return;
  lastUpdate = now;

  switch (state.effect) {
    case 0: effectSolid();    break;
    case 1: effectRainbow();  break;
    case 2: effectChase();    break;
    case 3: effectBreathe();  break;
    case 4: effectFire();     break;
    case 5: effectTwinkle();  break;
    case 6: effectWave();     break;
    case 7: effectGradient(); break;
  }
  FastLED.show();
}

// ─── Effects ─────────────────────────────────────────────
void effectSolid() {
  fill_solid(leds, NUM_LEDS, state.color1);
}

void effectRainbow() {
  fill_rainbow(leds, NUM_LEDS, effectHue++, 7);
}

void effectChase() {
  fadeToBlackBy(leds, NUM_LEDS, 40);
  int pos = beatsin16(map(state.speed, 1, 255, 10, 100), 0, NUM_LEDS - 1);
  leds[pos] = state.color1;
}

void effectBreathe() {
  uint8_t val = beatsin8(map(state.speed, 1, 255, 10, 60), 30, 255);
  CRGB c = state.color1;
  c.nscale8(val);
  fill_solid(leds, NUM_LEDS, c);
}

void effectFire() {
  static byte heat[NUM_LEDS];
  // Cool down
  for (int i = 0; i < NUM_LEDS; i++) {
    heat[i] = qsub8(heat[i], random8(0, ((55 * 10) / NUM_LEDS) + 2));
  }
  // Heat drifts up
  for (int k = NUM_LEDS - 1; k >= 2; k--) {
    heat[k] = (heat[k - 1] + heat[k - 2] + heat[k - 2]) / 3;
  }
  // Ignite
  if (random8() < 160) {
    int y = random8(7);
    heat[y] = qadd8(heat[y], random8(160, 255));
  }
  // Map to colors
  for (int j = 0; j < NUM_LEDS; j++) {
    leds[j] = HeatColor(heat[j]);
  }
}

void effectTwinkle() {
  fadeToBlackBy(leds, NUM_LEDS, 20);
  if (random8() < 80) {
    int pos = random16(NUM_LEDS);
    leds[pos] = random8() > 128 ? state.color1 : state.color2;
  }
}

void effectWave() {
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t wave = sin8(i * 10 + effectHue);
    leds[i] = blend(state.color1, state.color2, wave);
  }
  effectHue += 2;
}

void effectGradient() {
  fill_gradient_RGB(leds, 0, state.color1, NUM_LEDS - 1, state.color2);
}

// ─── Status JSON ─────────────────────────────────────────
String getStatusJson() {
  JsonDocument doc;
  doc["power"]      = state.power;
  doc["brightness"] = state.brightness;
  doc["effect"]     = state.effect;
  doc["speed"]      = state.speed;
  doc["heap"]       = ESP.getFreeHeap();
  doc["fw_version"] = String(FW_VERSION) + " (" + FW_BUILD_DATE + " " + FW_BUILD_TIME + ")";
  doc["fw_version_short"] = FW_VERSION;
  doc["fw_build_date"] = FW_BUILD_DATE;
  doc["fw_build_time"] = FW_BUILD_TIME;
  doc["num_leds"] = NUM_LEDS;
  doc["ap_ssid"]    = apSsid;
  doc["hostname"]   = localHostname;
  doc["connected"]  = WiFi.status() == WL_CONNECTED;
  doc["ip"]         = WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  
