noless-zz/esp8266-led-strip-clock/src/main.cpp
  // Connection stats
  if (WiFi.status() == WL_CONNECTED) {
    doc["sta_ssid"]  = WiFi.SSID();
    doc["sta_rssi"]  = WiFi.RSSI();
    doc["sta_channel"] = WiFi.channel();
    doc["sta_bssid"] = WiFi.BSSIDstr();
    int rssi = WiFi.RSSI();
    String quality = "Excellent";
    if (rssi < -80) quality = "Poor";
    else if (rssi < -70) quality = "Fair";
    else if (rssi < -60) quality = "Good";
    doc["sta_quality"] = quality;
  } else {
    doc["sta_ssid"]  = WiFi.SSID().length() > 0 ? WiFi.SSID() : "";
    doc["sta_rssi"]  = 0;
    doc["sta_channel"] = 0;
    doc["sta_bssid"] = "";
    doc["sta_quality"] = "Not connected";
  }
  doc["ap_active"]  = (WiFi.getMode() & WIFI_AP) != 0;
  doc["ap_clients"] = WiFi.softAPgetStationNum();
  doc["safe_mode"] = safeModeActive;
  doc["reset_reason"] = lastResetReason;
  doc["crash_count"] = bootCrashCount;
  doc["loop_latency_us"] = loopLatencyUs;
  doc["loop_latency_max_us"] = loopLatencyMaxUs;
  doc["heap_trend_delta"] = heapTrendDelta;
  doc["heap_trend_min"] = heapWindowMin;
  doc["heap_trend_max"] = heapWindowMax;
  doc["wifi_reconnects"] = wifiReconnectCount;

  JsonObject ota = doc["ota_status"].to<JsonObject>();
  ota["in_progress"] = otaStatus.inProgress;
  ota["last_success"] = otaStatus.lastSuccess;
  ota["last_error_code"] = otaStatus.lastErrorCode;
  ota["last_error_text"] = otaStatus.lastErrorText;
  ota["written_bytes"] = otaStatus.writtenBytes;
  ota["expected_bytes"] = otaStatus.expectedBytes;
  ota["last_file"] = otaStatus.lastFileName;
  
  char c1[8], c2[8];
  snprintf(c1, sizeof(c1), "#%02x%02x%02x", state.color1.r, state.color1.g, state.color1.b);
  snprintf(c2, sizeof(c2), "#%02x%02x%02x", state.color2.r, state.color2.g, state.color2.b);
  doc["color1"] = c1;
  doc["color2"] = c2;
  String out;
  serializeJson(doc, out);
  return out;
}

String getWifiScanJson() {
  JsonDocument doc;
  JsonArray arr = doc["networks"].to<JsonArray>();

  if (safeModeActive) {
    doc["scanning"] = false;
    doc["safe_mode"] = true;
    doc["error"] = "Safe mode active: STA scan disabled (AP-only recovery)";
    String out;
    serializeJson(doc, out);
    return out;
  }

  int scanState = WiFi.scanComplete();

  if (scanState == WIFI_SCAN_RUNNING) {
    doc["scanning"] = true;
  } else if (scanState == WIFI_SCAN_FAILED) {
    WiFi.scanDelete();
    WiFi.scanNetworks(true, true);
    doc["scanning"] = true;
  } else {
    doc["scanning"] = false;
    scanCacheCount = 0;
    for (int i = 0; i < scanState; i++) {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0) continue;
      JsonObject obj = arr.add<JsonObject>();
      obj["ssid"] = ssid;
      obj["rssi"] = WiFi.RSSI(i);
      obj["enc"]  = (WiFi.encryptionType(i) != ENC_TYPE_NONE);

      if (scanCacheCount < MAX_SCAN_CACHE) {
        scanCache[scanCacheCount].ssid = ssid;
        scanCache[scanCacheCount].rssi = WiFi.RSSI(i);
        scanCache[scanCacheCount].channel = WiFi.channel(i);
        scanCache[scanCacheCount].enc = WiFi.encryptionType(i);
        uint8_t* bssid = WiFi.BSSID(i);
        if (bssid != nullptr) {
          scanCache[scanCacheCount].hasBssid = true;
          memcpy(scanCache[scanCacheCount].bssid, bssid, 6);
        } else {
          scanCache[scanCacheCount].hasBssid = false;
        }
        scanCacheCount++;
      }
    }
    scanCacheUpdatedAt = millis();
    WiFi.scanDelete();
    if (scanState <= 0) {
      WiFi.scanNetworks(true, true);
      doc["scanning"] = true;
    }
  }

  String out;
  serializeJson(doc, out);
  return out;
}

void loadLedPowerState() {
  EEPROM.begin(EEPROM_SIZE);
  uint8_t magic = EEPROM.read(EEPROM_MAGIC_ADDR);
  if (magic == EEPROM_MAGIC) {
    state.power = EEPROM.read(EEPROM_POWER_ADDR) == 1;
  } else {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.write(EEPROM_POWER_ADDR, state.power ? 1 : 0);
    EEPROM.commit();
  }
  Serial.printf("[LED] Restored power state: %s\n", state.power ? "ON" : "OFF");
}

void saveLedPowerState() {
  EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
  EEPROM.write(EEPROM_POWER_ADDR, state.power ? 1 : 0);
  EEPROM.commit();
  Serial.printf("[LED] Saved power state: %s\n", state.power ? "ON" : "OFF");
}

bool isCrashResetReason(const String& reason) {
  String r = reason;
  r.toLowerCase();
  return r.indexOf("wdt") >= 0 || r.indexOf("exception") >= 0 || r.indexOf("panic") >= 0;
}

void evaluateSafeModeOnBoot() {
  EEPROM.begin(EEPROM_SIZE);
  lastResetReason = ESP.getResetReason();

  if (EEPROM.read(EEPROM_MAGIC_ADDR) != EEPROM_MAGIC) {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.write(EEPROM_POWER_ADDR, state.power ? 1 : 0);
    EEPROM.write(EEPROM_CRASH_COUNT_ADDR, 0);
    EEPROM.commit();
  }

  bootCrashCount = EEPROM.read(EEPROM_CRASH_COUNT_ADDR);
  if (isCrashResetReason(lastResetReason)) {
    if (bootCrashCount < 250) {
      bootCrashCount++;
    }
  } else if (bootCrashCount > 0) {
    bootCrashCount--;
  }

  EEPROM.write(EEPROM_CRASH_COUNT_ADDR, bootCrashCount);
  EEPROM.commit();

  safeModeActive = bootCrashCount >= SAFE_MODE_CRASH_THRESHOLD;
  Serial.println("[BOOT] Reset reason: " + lastResetReason);
  Serial.printf("[BOOT] Crash counter: %u\n", bootCrashCount);
  if (safeModeActive) {
    Serial.println("[SAFE MODE] Triggered due to repeated crash resets");
  }
}

void applySafeModeDefaults() {
  state.power = true;
  state.effect = 0;
  state.brightness = min<uint8_t>(state.brightness, 96);
  state.color1 = CRGB(255, 80, 0);
  FastLED.setBrightness(state.brightness);
  fill_solid(leds, NUM_LEDS, state.color1);
  FastLED.show();
}

void maybeClearCrashCounterAfterStableUptime() {
  if (safeModeActive || crashCounterCleared) {
    return;
  }
  if (millis() - bootStartedAt < SAFE_MODE_CLEAR_UPTIME_MS) {
    return;
  }
  if (bootCrashCount > 0) {
    bootCrashCount = 0;
    EEPROM.write(EEPROM_CRASH_COUNT_ADDR, 0);
    EEPROM.commit();
    Serial.println("[BOOT] Crash counter cleared after stable uptime");
  }
  crashCounterCleared = true;
}

void updateTelemetry() {
  unsigned long nowUs = micros();
  if (loopLastMicros != 0) {
    loopLatencyUs = nowUs - loopLastMicros;
    if (loopLatencyUs > loopLatencyMaxUs) {
      loopLatencyMaxUs = loopLatencyUs;
    }
  }
  loopLastMicros = nowUs;

