noless-zz/esp8266-led-strip-clock/src/main.cpp
      if (foundSsid == ssid) {
        wifiConnect.targetSeenInScan = true;
        wifiConnect.targetChannel = WiFi.channel(i);
        wifiConnect.targetRssi = WiFi.RSSI(i);
        wifiConnect.targetEnc = WiFi.encryptionType(i);
        uint8_t* bssid = WiFi.BSSID(i);
        if (bssid != nullptr) {
          wifiConnect.targetHasBssid = true;
          memcpy(wifiConnect.targetBssid, bssid, 6);
        }
      }
    }
    scanCacheUpdatedAt = millis();
    WiFi.scanDelete();
  }

  if (wifiConnect.targetChannel > 0 && wifiConnect.targetHasBssid) {
    Serial.printf("[WiFi] Using channel %d + BSSID lock\n", wifiConnect.targetChannel);
    WiFi.begin(ssid.c_str(), pass.c_str(), wifiConnect.targetChannel, wifiConnect.targetBssid, true);
  } else if (wifiConnect.targetChannel > 0) {
    Serial.printf("[WiFi] Using channel %d from scan cache\n", wifiConnect.targetChannel);
    WiFi.begin(ssid.c_str(), pass.c_str(), wifiConnect.targetChannel);
  } else {
    WiFi.begin(ssid.c_str(), pass.c_str());
  }
  delay(200);
  
  Serial.println("[WiFi] Connecting...");
  Serial.println("[WiFi] SSID: " + ssid);
  Serial.printf("[WiFi] Password length: %u\n", wifiConnect.passLen);
  Serial.printf("[WiFi] ESP8266 MAC: %s\n", WiFi.macAddress().c_str());
  Serial.printf("[WiFi] Status before begin: %s (%d)\n", wifiStatusToString(wifiConnect.lastStatus), wifiConnect.lastStatus);
  Serial.printf("[WiFi] WiFi mode: %d (1=STA, 2=AP, 3=AP_STA)\n", (int)WiFi.getMode());
  Serial.printf("[WiFi] AP enabled: %s, STA enabled: %s\n",
    (WiFi.getMode() & WIFI_AP) ? "yes" : "no",
    (WiFi.getMode() & WIFI_STA) ? "yes" : "no");
  if (wifiConnect.targetSeenInScan) {
    Serial.printf("[WiFi] Target seen in scan: yes, CH=%d RSSI=%d ENC=%s (%d)\n",
      wifiConnect.targetChannel,
      (int)wifiConnect.targetRssi,
      wifiEncryptionToString(wifiConnect.targetEnc),
      wifiConnect.targetEnc);
  } else {
    Serial.printf("[WiFi] Target seen in last scan cache: no (cache_count=%d, age_ms=%lu)\n", scanCacheCount, millis() - scanCacheUpdatedAt);
  }

  return true;
}

void updateWiFiConnect() {
  if (!wifiConnect.active) {
    return;
  }

  wifiConnect.lastStatus = WiFi.status();
  wifiConnect.lastElapsedMs = millis() - wifiConnect.startedAt;

  if (WiFi.status() == WL_CONNECTED) {
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    dnsServer.stop();
    setupMDNS();
    Serial.print("WiFi connected. IP: ");
    Serial.println(WiFi.localIP());

    wifiConnect.active = false;
    wifiConnect.resultReady = wifiConnect.reportResult;
    wifiConnect.success = true;
    wifiConnect.error = "";
    Serial.printf("[WiFi] Connected to %s in %lu ms\n", wifiConnect.attemptedSsid.c_str(), wifiConnect.lastElapsedMs);
    Serial.printf("[WiFi] STA IP: %s, BSSID: %s, CH: %d, RSSI: %d\n",
      WiFi.localIP().toString().c_str(),
      WiFi.BSSIDstr().c_str(),
      WiFi.channel(),
      WiFi.RSSI());
    return;
  }

  if (millis() - wifiConnect.startedAt >= wifiConnect.timeoutMs) {
    String hint = buildWifiFailureHint();
    String errorText = String("Could not connect to '") + wifiConnect.attemptedSsid +
      "'. status=" + wifiStatusToString(wifiConnect.lastStatus) +
      " (" + String((int)wifiConnect.lastStatus) + "). " + hint;

    Serial.println("[WiFi] Connect failed");
    Serial.printf("[WiFi] SSID: %s, elapsed: %lu ms\n", wifiConnect.attemptedSsid.c_str(), wifiConnect.lastElapsedMs);
    Serial.printf("[WiFi] Final status: %s (%d)\n", wifiStatusToString(wifiConnect.lastStatus), wifiConnect.lastStatus);
    if (wifiConnect.targetSeenInScan) {
      Serial.printf("[WiFi] Scan cache target: CH=%d RSSI=%d ENC=%s (%d)\n",
        wifiConnect.targetChannel,
        (int)wifiConnect.targetRssi,
        wifiEncryptionToString(wifiConnect.targetEnc),
        wifiConnect.targetEnc);
    } else {
      Serial.println("[WiFi] Scan cache target: not seen");
    }
    Serial.println("[WiFi] Hint: " + hint);

    wifiConnect.active = false;
    wifiConnect.resultReady = wifiConnect.reportResult;
    wifiConnect.success = false;
    wifiConnect.error = errorText;
    
    // Fallback to AP mode on failure
    ensureApFallback();
  }
}

void ensureApFallback() {
  if ((WiFi.getMode() & WIFI_AP) == 0) {
    Serial.println("[WiFi] STA failed, re-enabling AP fallback");
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(apSsid.c_str(), AP_PASS);
    delay(100);
    setupDNS();
    Serial.print("[WiFi] AP fallback IP: ");
    Serial.println(WiFi.softAPIP());
  }
}

void trackClientActivity() {
  static unsigned long lastCheck = 0;
  if (millis() - lastCheck < 5000) return;
  lastCheck = millis();
  
  activeClientCount = WiFi.softAPgetStationNum();
  if (activeClientCount > 0) {
    lastClientActivity = millis();
  }
}

void checkPeriodicStaRetry() {
  // Only retry if:
  // 1. Not currently connecting
  // 2. Not connected
  // 3. Have saved credentials
  // 4. Retry interval elapsed
  // 5. No active clients (or client inactive for 2min)
  
  if (safeModeActive) return;
  if (wifiConnect.active) return;
  if (WiFi.status() == WL_CONNECTED) return;
  if (WiFi.SSID().length() == 0) return;
  if (millis() - lastStaRetryAt < STA_RETRY_INTERVAL) return;
  
  bool hasRecentActivity = (millis() - lastClientActivity < 120000);
  if (activeClientCount > 0 && hasRecentActivity) return;
  
  Serial.println("[WiFi] Periodic STA retry attempt");
  lastStaRetryAt = millis();
  
  if (beginWiFiConnectAttempt(15000, false)) {
    WiFi.mode(WIFI_AP_STA);
    WiFi.hostname(localHostname.c_str());
    WiFi.begin();
    Serial.printf("[WiFi] Retrying saved SSID: %s\n", WiFi.SSID().c_str());
  }
}

// ─── Parse hex color ─────────────────────────────────────
CRGB parseHexColor(const String& hex) {
  String h = hex;
  if (h.startsWith("#")) h = h.substring(1);
  long val = strtol(h.c_str(), NULL, 16);
  return CRGB((val >> 16) & 0xFF, (val >> 8) & 0xFF, val & 0xFF);
}

// ─── Web Server ──────────────────────────────────────────
void setupWebServer() {
  // ── Captive portal detection endpoints ──
  // Android
  server.on("/generate_204", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  server.on("/gen_204", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  // Apple
  server.on("/hotspot-detect.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  server.on("/library/test/success.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  // Microsoft
  server.on("/connecttest.txt", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  server.on("/ncsi.txt", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  // Firefox
  server.on("/canonical.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });

