noless-zz/esp8266-led-strip-clock/src/main.cpp
  // ── Main page ──
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send_P(200, "text/html", INDEX_HTML);
  });

  // ── API Endpoints ──
  server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/power", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("on")) {
      bool newPower = req->getParam("on")->value() == "1";
      if (state.power != newPower) {
        state.power = newPower;
        saveLedPowerState();
      }
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/brightness", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      state.brightness = req->getParam("value")->value().toInt();
      FastLED.setBrightness(state.brightness);
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/speed", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      state.speed = req->getParam("value")->value().toInt();
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/effect", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("id")) {
      state.effect = req->getParam("id")->value().toInt();
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/color", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("c1")) {
      state.color1 = parseHexColor(req->getParam("c1")->value());
    }
    if (req->hasParam("c2")) {
      state.color2 = parseHexColor(req->getParam("c2")->value());
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getWifiScanJson());
  });

  server.on("/api/wifi/connect", HTTP_GET, [](AsyncWebServerRequest *req) {
    JsonDocument doc;
    doc["hostname"] = localHostname;
    doc["safe_mode"] = safeModeActive;

    if (safeModeActive) {
      doc["connecting"] = false;
      doc["connected"] = false;
      doc["error"] = "Safe mode active: STA disabled. Reboot into normal mode after stabilizing firmware.";
      String out;
      serializeJson(doc, out);
      req->send(200, "application/json", out);
      return;
    }

    if (req->hasParam("ssid")) {
      if (wifiConnect.active) {
        doc["connecting"] = true;
      } else {
        String ssid = req->getParam("ssid")->value();
        String pass = req->hasParam("pass") ? req->getParam("pass")->value() : "";
        if (startWiFiConnect(ssid, pass)) {
          doc["connecting"] = true;
        } else {
          doc["connecting"] = false;
          doc["connected"] = false;
          doc["error"] = "Missing SSID or connection already in progress";
        }
      }
    } else if (wifiConnect.active) {
      doc["connecting"] = true;
    } else if (wifiConnect.resultReady) {
      doc["connecting"] = false;
      doc["connected"] = wifiConnect.success;
      doc["ip"] = wifiConnect.success ? WiFi.localIP().toString() : "";
      if (!wifiConnect.success) {
        doc["error"] = wifiConnect.error;
      }
      wifiConnect.resultReady = false;
    } else {
      doc["connecting"] = false;
      doc["connected"] = WiFi.status() == WL_CONNECTED;
      doc["ip"] = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : "";
      if (WiFi.status() != WL_CONNECTED) {
        doc["error"] = "No active connection attempt";
      }
    }

    JsonObject debug = doc["debug"].to<JsonObject>();
    debug["ssid"] = wifiConnect.attemptedSsid;
    debug["status"] = wifiStatusToString(wifiConnect.lastStatus);
    debug["status_code"] = (int)wifiConnect.lastStatus;
    debug["elapsed_ms"] = wifiConnect.lastElapsedMs;
    debug["target_seen"] = wifiConnect.targetSeenInScan;
    debug["target_channel"] = wifiConnect.targetChannel;
    debug["target_rssi"] = wifiConnect.targetRssi;
    debug["target_encryption"] = wifiEncryptionToString(wifiConnect.targetEnc);
    debug["target_encryption_code"] = wifiConnect.targetEnc;
    debug["scan_cache_count"] = scanCacheCount;
    debug["scan_cache_age_ms"] = scanCacheUpdatedAt > 0 ? (millis() - scanCacheUpdatedAt) : -1;
    debug["hint"] = buildWifiFailureHint();

    String out;
    serializeJson(doc, out);
    req->send(200, "application/json", out);
  });

  server.on("/api/update/status", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getOtaStatusJson());
  });

  server.on("/api/update/precheck", HTTP_GET, [](AsyncWebServerRequest *req) {
    JsonDocument doc;
    if (!req->hasParam("name") || !req->hasParam("size") || !req->hasParam("magic")) {
      doc["ok"] = false;
      doc["error"] = "Missing name/size/magic";
    } else {
      String name = req->getParam("name")->value();
      size_t size = (size_t) req->getParam("size")->value().toInt();
      int magic = req->getParam("magic")->value().toInt();
      uint32_t maxSize = getMaxUpdateSize();

      bool extOk = name.endsWith(".bin") || name.endsWith(".BIN");
      bool sizeOk = size > 0 && size <= maxSize;
      bool magicOk = (magic == 0xE9);

      doc["ok"] = extOk && sizeOk && magicOk;
      doc["ext_ok"] = extOk;
      doc["size_ok"] = sizeOk;
      doc["magic_ok"] = magicOk;
      doc["max_size"] = maxSize;
      doc["file_size"] = size;
      doc["magic"] = magic;

      if (doc["ok"].as<bool>()) {
        doc["summary"] = String("name=") + name + ", size=" + String(size) + " bytes, max=" + String(maxSize) + ", magic=0xE9";
      } else {
        String err;
        if (!extOk) err += "File must be .bin. ";
        if (!sizeOk) err += "File too large for available OTA space. ";
        if (!magicOk) err += "Invalid firmware header (expected 0xE9).";
        doc["error"] = err;
      }
    }
    String out;
    serializeJson(doc, out);
    req->send(200, "application/json", out);
  });

  // ── Firmware Update (HTTP) ──
  server.on("/api/update", HTTP_POST,
    // Response handler
    [](AsyncWebServerRequest *req) {
      JsonDocument doc;
      bool approved = req->hasParam("approve") && req->getParam("approve")->value() == "1";
      bool success = approved && otaStatus.lastSuccess && !Update.hasError() && otaStatus.writtenBytes > 0;

      otaStatus.inProgress = false;
      otaStatus.finishedAt = millis();
      otaStatus.lastSuccess = success;
      otaStatus.approved = approved;

      if (!approved) {
        otaStatus.lastErrorCode = UPDATE_ERROR_STREAM;
        otaStatus.lastErrorText = "Upload not approved. Run precheck and confirm upload in Web UI.";
      } else if (Update.hasError()) {
        otaStatus.lastErrorCode = Update.getError();
        otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
      } else if (!otaStatus.lastSuccess) {
        otaStatus.lastErrorCode = UPDATE_ERROR_STREAM;
        otaStatus.lastErrorText = "Upload finalization failed.";
      } else {
        otaStatus.lastErrorCode = UPDATE_ERROR_OK;
        otaStatus.lastErrorText = "OK";
      }

      doc["ok"] = success;
      doc["approved"] = approved;
      doc["written"] = otaStatus.writtenBytes;
      doc["expected"] = otaStatus.expectedBytes;
      doc["error_code"] = otaStatus.lastErrorCode;
      doc["error"] = otaStatus.lastErrorText;
      doc["file"] = otaStatus.lastFileName;

      String out;
      serializeJson(doc, out);
      req->send(success ? 200 : 500, "application/json", out);

      if (success) {
        delay(600);
        ESP.restart();
      }
    },
    // Upload handler
    [](AsyncWebServerRequest *req, String filename, size_t index, uint8_t *data, size_t len, bool final) {
      if (index == 0) {
        bool approved = req->hasParam("approve") && req->getParam("approve")->value() == "1";
        if (!approved) {
          otaStatus.inProgress = false;
          otaStatus.lastSuccess = false;
          otaStatus.lastErrorCode = UPDATE_ERROR_STREAM;
          otaStatus.lastErrorText = "Missing approve=1";
          otaStatus.lastFileName = filename;
          return;
        }

        otaVisualActive = true;
        otaStatus.inProgress = true;
        otaStatus.approved = true;
        otaStatus.lastSuccess = false;
        otaStatus.lastErrorCode = 0;
        otaStatus.lastErrorText = "";
        otaStatus.lastFileName = filename;
        otaStatus.expectedBytes = req->contentLength();
        otaStatus.writtenBytes = 0;
        otaStatus.startedAt = millis();

        Serial.printf("Update: %s (%u bytes)\n", filename.c_str(), req->contentLength());
        // Disable LEDs during update
        FastLED.clear(true);
        uint32_t maxSize = getMaxUpdateSize();

        otaDbg.active = true;
        otaDbg.pendingInit = true;
        otaDbg.pendingFinal = false;
        otaDbg.pendingError = false;
        otaDbg.cbCount = 0;
        otaDbg.chunkCount = 0;
        otaDbg.totalBytes = 0;
        otaDbg.expectedBytes = req->contentLength();
        otaDbg.lastIdx = 0;
        otaDbg.lastLen = 0;
        otaDbg.lastOffset = 0;
        otaDbg.lastReqChunk = 0;
        otaDbg.lastWrote = 0;
        otaDbg.lastDtUs = 0;
        otaDbg.maxDtUs = 0;
        otaDbg.lastHeap = ESP.getFreeHeap();
        otaDbg.initHeap = otaDbg.lastHeap;
        otaDbg.maxUpdateSize = maxSize;
        otaDbg.lastErr = 0;
        otaDbg.finalOk = false;
        otaDbg.finalDtMs = 0;

