noless-zz/esp8266-led-strip-clock/src/main.cpp
        if (req->contentLength() == 0 || req->contentLength() > maxSize) {
          otaStatus.lastErrorCode = UPDATE_ERROR_SPACE;
          otaStatus.lastErrorText = "Firmware size invalid for current OTA partition.";
          otaDbg.lastErr = otaStatus.lastErrorCode;
          otaDbg.pendingError = true;
          otaStatus.inProgress = false;
          return;
        }

        Update.runAsync(true);

        if (!Update.begin(maxSize, U_FLASH)) {
          otaStatus.lastErrorCode = Update.getError();
          otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
          otaDbg.lastErr = otaStatus.lastErrorCode;
          otaDbg.pendingError = true;
        }
      }
      if (!Update.hasError()) {
        static uint32_t cbCounter = 0;
        static uint32_t chunkCounter = 0;
        cbCounter++;
        otaDbg.cbCount = cbCounter;
        otaDbg.lastIdx = index;
        otaDbg.lastLen = len;
        otaDbg.lastHeap = ESP.getFreeHeap();

        size_t written = 0;
        const size_t CHUNK_SIZE = 32;
        
        while (written < len && !Update.hasError()) {
          size_t chunk = min((size_t)(len - written), CHUNK_SIZE);
          uint32_t tStartUs = micros();
          size_t result = Update.write(data + written, chunk);
          uint32_t dtUs = micros() - tStartUs;
          chunkCounter++;
          otaDbg.chunkCount = chunkCounter;
          otaDbg.lastOffset = index + written;
          otaDbg.lastReqChunk = chunk;
          otaDbg.lastWrote = result;
          otaDbg.lastDtUs = dtUs;
          if (dtUs > otaDbg.maxDtUs) {
            otaDbg.maxDtUs = dtUs;
          }
          otaDbg.lastErr = Update.getError();
          otaDbg.lastHeap = ESP.getFreeHeap();
          otaDbg.totalBytes = index + written + result;

          if (result != chunk) {
            otaStatus.lastErrorCode = Update.getError();
            otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
            otaDbg.lastErr = otaStatus.lastErrorCode;
            otaDbg.pendingError = true;
            break;
          }
          written += chunk;
          ESP.wdtFeed();
        }
        
        if (written == len) {
          otaStatus.writtenBytes = index + len;
          otaDbg.totalBytes = otaStatus.writtenBytes;
        }
      }
      if (final) {
        // Finalize using actual written size; begin() was called with max OTA partition size
        // so end(true) is required to close successfully at current progress.
        uint32_t endStartMs = millis();
        bool endOk = Update.end(true);
        uint32_t endDtMs = millis() - endStartMs;
        otaDbg.finalOk = endOk;
        otaDbg.finalDtMs = endDtMs;
        otaDbg.lastErr = Update.getError();
        otaDbg.lastHeap = ESP.getFreeHeap();
        otaDbg.pendingFinal = true;

        if (endOk) {
          size_t finalBytes = index + len;
          otaStatus.writtenBytes = finalBytes;
          otaStatus.expectedBytes = finalBytes;
          otaDbg.totalBytes = finalBytes;
          otaDbg.expectedBytes = finalBytes;
          otaVisualActive = false;
          otaStatus.lastSuccess = true;
          otaStatus.finishedAt = millis();
          Update.runAsync(false);
        } else {
          otaStatus.lastErrorCode = Update.getError();
          otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
          otaDbg.lastErr = otaStatus.lastErrorCode;
          otaDbg.pendingError = true;
          otaVisualActive = false;
          otaStatus.inProgress = false;
          Update.runAsync(false);
        }
      }
    }
  );

  // ── Catch-all for captive portal ──
  server.onNotFound([](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });

  server.begin();
  Serial.println("HTTP server started");
}
